// переменная - ячейка в памяти компьютера, заданная пользователем и
// хранящая в себе данные об объекте

/* основные типы данных:

1. целочисленные
- char: 1 байт, от -128 до 127 или от 0 до 255
- signed short: 2 байта, от -32768 до 32767
- unsigned short: 2 байта, от 0 до 65535
- int: 2 или 4 байта, от -32768 до 32767 или от -2 147 483 648 до 2 147 483 647 соответственно
- unsigned int: 2 или 4 байта, 0 до 65535, либо от 0 до 4 294 967 295 соответственно
- long:  4 или 8 байт, от −2 147 483 648 до 2 147 483 647
         или от −9 223 372 036 854 775 808 до 9 223 372 036 854 775 807 соответственно
- unsigned long: 4 байта, от 0 до 4 294 967 295
- long long: 8 байт, от −9 223 372 036 854 775 808 до 9 223 372 036 854 775 807
- unsigned long long: 8 байт, от 0 до 18 446 744 073 709 551 615.

2. вещественные
- float: 4 байта, от 3.14E–38 до 3.14E+38
- double: 8 байт, от 1.7E–308 до 1.7E+308
- long double: 8 байт, от 2.23E-308 до 1.8E+308.

3. символьные
- char: 1 байт, от 0 до 255
- wchar_t: 2 или 4 байта, от 0 до 65 535 или от 0 до 4 294 967 295 соответственно
- char8_t: 1 байт, от 0 до 256
- char16_t: 2 байта, от 0 до 65 535
- char32_t: 4 байта, от 0 до 4 294 967 295.

4. логические
- bool: 1 или 0.
*/


#include <iostream>
using namespace std;

void dataTypeOutput()
{
   
    cout << "-----целочисленный тип данных-----" << endl;
    cout << "название типа: char, размер: 1 байт, мин. и макс. значения: от - 128 до 127 или от 0 до 255" << endl;
    cout << "название типа: int, размер: 2 или 4 байта, мин. и макс. значения: от -32768 до 32767 или от -2 147 483 648 до 2 147 483 647" << endl;
    cout << "название типа: unsigned long, размер: 4 байта, мин. и макс. значения: от 0 до 4 294 967 295" << endl;
    cout << "название типа: long long, размер: 8 байт, мин. и макс. значения: от −9 223 372 036 854 775 808 до 9 223 372 036 854 775 807" << endl;

    cout << "-----вещественный тип данных-----" << endl;
    cout << "название типа: float, размер: 4 байта, мин. и макс. значения: от 3.14E–38 до 3.14E+38" << endl;
    cout << "название типа: double, размер: 8 байт, мин. и макс. значения: от 1.7E–308 до 1.7E+308" << endl;
    cout << "название типа: long double, размер: 8 байт, мин. и макс. значения: от 2.23E-308 до 1.8E+308." << endl;

    cout << "-----символьный тип данных-----" << endl;
    cout << "название типа: char, размер: 1 байт, мин. и макс. значения: от - 128 до 127 или от 0 до 255" << endl;
    cout << "название типа: char16_t, размер: 2 байта, мин. и макс. значения: от 0 до 65 535"  << endl;
    cout << "название типа: char32_t, размер: 4 байта, мин. и макс. значения: от 0 до 4 294 967 295" << endl;

    cout << "-----логический тип данных-----" << endl;
    cout << "название типа: bool, размер: 1 байт, мин. и макс. значения: от 0 до 255" << endl << "\n";

}

int examples()
{
    cout << "примеры выполнения арифметических операций:" << endl;

    char ch1 = 30, ch2 = 9;
    cout << "char: 30 x 9 = " << ch1 * ch2 << endl;
    int num1 = -32500, num2 = 52;
    cout << "int: -32500 / 52 = " << num1 / num2 << endl;
    unsigned long unlong1 = 2'067'388'567, unlong2 = 1'122'111'890;
    cout << "unsigned long: 2'067'388'567 + 1'122'111'890 = " << unlong1 + unlong2 << endl;
    long long long1 = pow(2, 63), long2 = pow(2, 62);
    cout << "long long: 2^63 - 2^62 = " << long1 - long2 << endl << "\n";

    float fl_res = 22.0f / 7.0f;
    cout << "float: 22 / 7 = " << fl_res << endl; // точность 7 знаков
    double doub_res = 22.0 / 7.0;
    cout << "double: 22 / 7 = " << doub_res << endl; // точность 16 знаков
    long double long_d_res = 22.0l / 7.0l;
    cout << "long double: 22 / 7 = " << long_d_res << endl << "\n"; // точность 18-19 знаков

    char ch_num1 = 'j', ch_num2 = 35;
    cout << "char: 'j' - 35 = " << ch_num1 - ch_num2 << endl;
    char16_t ch16 = 'ß' + 3000;
    cout << "char16_t: 'ß' + 3000 = " << ch16 << endl;

    bool b_true = true, b_false = false;
    cout << "bool: -1 + true = " << -1 + b_true << endl;
    cout << "bool: true / false = " << b_true / b_false;

    return 0;
}

int main()
{
    dataTypeOutput();
    examples();
}

